# DataFrames

In [1]:
# importar el modulo Pandas
import pandas as pd

In [2]:
# crear un dataframe a partir de una lista
data2 = [['Juan', 4.5], ['Pedro', 8.9],['Estefania',1.4], ['Ana',5.6],['Esteban',7.8]]
columnasNombres = ['Nombre','Nota']
filas = list(range(len(data2)))  # [0,1,2,3,4]
df = pd.DataFrame(data2, columns=columnasNombres, index=filas)
df

      Nombre  Nota
0       Juan   4.5
1      Pedro   8.9
2  Estefania   1.4
3        Ana   5.6
4    Esteban   7.8

In [3]:
# Obtener informacion
df.info  # atributo, sin parentesis

<bound method DataFrame.info of       Nombre  Nota
0       Juan   4.5
1      Pedro   8.9
2  Estefania   1.4
3        Ana   5.6
4    Esteban   7.8>

In [4]:
# Mostrar la forma del dataframe (num_filas, num_columnas)
df.shape

(5, 2)

In [5]:
# tamaño del dataframe (num_filas * num_columnas)
df.size

10

In [6]:
# Mostrar los nombres de las columnas
df.columns

Index(['Nombre', 'Nota'], dtype='object')

In [7]:
# Mostrar los indices
df.index

Index([0, 1, 2, 3, 4], dtype='int64')

In [8]:
# Tipos de datos de las columnas
df.dtypes

Nombre     object
Nota      float64
dtype: object

In [9]:
# Mostrar las primeras 3 filas
df.head(3)

      Nombre  Nota
0       Juan   4.5
1      Pedro   8.9
2  Estefania   1.4

In [10]:
# Mostrar las 3 ultimas filas
df.tail(3)

      Nombre  Nota
2  Estefania   1.4
3        Ana   5.6
4    Esteban   7.8

In [81]:
# crear un dataframe a partir de un diccionario
dictNombreNotas1 = { 
"Id": [1,2,3,4,5] ,
"Nombre" : ['Juan', 'Pedro','Estefania', 'Ana', 'Esteban'],
"Apellido": ['Garcia', 'Sanchez', 'Lopez', 'Garcia', 'Gonzalez' ],
"Nota": [4.5, 8.9, 1.4, 5.6, 7.8]
}
dfDesdeDict1 = pd.DataFrame(dictNombreNotas1)
dfDesdeDict1

   Id     Nombre  Apellido  Nota
0   1       Juan    Garcia   4.5
1   2      Pedro   Sanchez   8.9
2   3  Estefania     Lopez   1.4
3   4        Ana    Garcia   5.6
4   5    Esteban  Gonzalez   7.8

In [12]:
# Otra forma de crear el dataframe a partir de un diccionario
dictNombreNotas2 = [{'Id':6, 'Nombre':'Silvia', 'Apellido':'Gonzalez','Nota':5.5},
                   {'Id':7, 'Nombre':'Pedro', 'Apellido':'Perez','Nota':8.9}]
dfDesdeDict2 = pd.DataFrame(dictNombreNotas2)
dfDesdeDict2

   Id  Nombre  Apellido  Nota
0   6  Silvia  Gonzalez   5.5
1   7   Pedro     Perez   8.9

In [13]:
# Acceso a los datos:
# iloc[] -> acceso por posicion[fila,columna]
dfDesdeDict1.iloc[2,3]

1.4

In [14]:
# Queremos obtener los datos desde la fila 1 a la 3
dfDesdeDict1.iloc[1:3]  # solo la fila 1 y 2 con todas las columnas
dfDesdeDict1.iloc[1:3,] # solo la fila 1 y 2 con todas las columnas
dfDesdeDict1.iloc[1:3,:]  # solo la fila 1 y 2 con todas las columnas  [rango_filas, rango_columnas]

   Id     Nombre Apellido  Nota
1   2      Pedro  Sanchez   8.9
2   3  Estefania    Lopez   1.4

In [15]:
# Queremos obtener los datos desde la fila 1 con las 3 primeras columnas
dfDesdeDict1.iloc[1:3:3]

   Id Nombre Apellido  Nota
1   2  Pedro  Sanchez   8.9

In [16]:
# Queremos obtener los datos desde la fila 1 hasta la 3 con las 3 primeras columnas
dfDesdeDict1.iloc[1:3,:3]

   Id     Nombre Apellido
1   2      Pedro  Sanchez
2   3  Estefania    Lopez

In [17]:
# Mostrar todas las filas desde 0, solo 2 primeras columnas
dfDesdeDict1.iloc[:,:2]
dfDesdeDict1.iloc[:,0:2]  # es lo mismo

   Id     Nombre
0   1       Juan
1   2      Pedro
2   3  Estefania
3   4        Ana
4   5    Esteban

In [18]:
#También funciona para seleccionar diferentes columnas y/o filas:
dfDesdeDict1.iloc[1:4,[1,3]] #mostrar ciertas columnas: nombre y nota

dfDesdeDict1.iloc[[1,4],[1,3]] #mostrar ciertas filas y ciertas columnas

    Nombre  Nota
1    Pedro   8.9
4  Esteban   7.8

In [19]:
# Acceso a los datos:
# loc[] -> acceso por indice[nombre_indice_fila]
dfDesdeDict1.loc[2]

Id                  3
Nombre      Estefania
Apellido        Lopez
Nota              1.4
Name: 2, dtype: object

In [20]:
# Mostrar la fila 2 y fila 4
dfDesdeDict1.loc[[2,4]]

   Id     Nombre  Apellido  Nota
2   3  Estefania     Lopez   1.4
4   5    Esteban  Gonzalez   7.8

In [21]:
# Mostrar desde el indice de la fila 2 a la fila 4
dfDesdeDict1.loc[2:4]

   Id     Nombre  Apellido  Nota
2   3  Estefania     Lopez   1.4
3   4        Ana    Garcia   5.6
4   5    Esteban  Gonzalez   7.8

In [22]:
# crear un dataframe a partir de una lista
data2 = [['Juan', 4.5], ['Pedro', 8.9],['Estefania',1.4], ['Ana',5.6],['Esteban',7.8]]
columnas = ['Nombre','Nota']
filas = [10,11,12,13,14]
df = pd.DataFrame(data2, columns=columnasNombres, index=filas)
df

       Nombre  Nota
10       Juan   4.5
11      Pedro   8.9
12  Estefania   1.4
13        Ana   5.6
14    Esteban   7.8

In [23]:
# iloc -> accedemos por el orden de la fila
df.iloc[1,:]  # 1 representa la segunda fila

Nombre    Pedro
Nota        8.9
Name: 11, dtype: object

In [24]:
# loc -> accedemos por el nombre del indice de la fila
#df.loc[1]  # error porque el indice 1 no existe
df.loc[11]

Nombre    Pedro
Nota        8.9
Name: 11, dtype: object

In [25]:
# Solo la nota de Pedro [indice,['columna']]
df.loc[11,['Nota']]

Nota    8.9
Name: 11, dtype: object

In [26]:
# Solo la nota de Pedro y Ana [[indice, indice],['columna']]
df.loc[[11,13],['Nota']]

    Nota
11   8.9
13   5.6

In [27]:
# no puedo poner rangos
#df.loc[[11:13],['Nota']]  # error
df.loc[11:13]['Nota']  # si funciona

11    8.9
12    1.4
13    5.6
Name: Nota, dtype: float64

In [28]:
# Solo la nota de Pedro df['columna'].loc[indice]
df['Nota'].loc[11]

8.9

In [29]:
# nota de Pedro
df.loc[11]['Nota']

8.9

In [30]:
# Mostrar solo las columnas (series) indicadas
dfDesdeDict1['Apellido']

0      Garcia
1     Sanchez
2       Lopez
3      Garcia
4    Gonzalez
Name: Apellido, dtype: object

In [31]:
dfDesdeDict1[['Nombre','Apellido']]

      Nombre  Apellido
0       Juan    Garcia
1      Pedro   Sanchez
2  Estefania     Lopez
3        Ana    Garcia
4    Esteban  Gonzalez

In [32]:
# Nombre y apellido de Ana
dfDesdeDict1[['Nombre','Apellido']].loc[3]  # filtras por serie y buscas la fila con el indice 3
dfDesdeDict1.loc[3][['Nombre','Apellido']]  # primero obtienes la fila y luego filtras por columna

Nombre         Ana
Apellido    Garcia
Name: 3, dtype: object

In [33]:
# Nombre y apellido del elemento que esta en la posicion del indice 4
dfDesdeDict1[['Nombre','Apellido']].iloc[4]

Nombre       Esteban
Apellido    Gonzalez
Name: 4, dtype: object

In [82]:
# Agregar nueva columna al dataframe
resultado = ['Suspenso','Aprobado','Suspenso','Aprobado','Aprobado']
dfDesdeDict1.insert(loc=3, column="Resultado", value=resultado)
dfDesdeDict1

   Id     Nombre  Apellido Resultado  Nota
0   1       Juan    Garcia  Suspenso   4.5
1   2      Pedro   Sanchez  Aprobado   8.9
2   3  Estefania     Lopez  Suspenso   1.4
3   4        Ana    Garcia  Aprobado   5.6
4   5    Esteban  Gonzalez  Aprobado   7.8

In [83]:
# Media de los aprobados y suspensos
dfDesdeDict1.groupby(["Resultado"]).mean(["Nota"])

                 Id      Nota
Resultado
Aprobado   3.666667  7.433333
Suspenso   2.000000  2.950000

In [75]:
# Agregar los datos del dfDesdeDict2 al dfDesdeDict1
# Note: pandas.DataFrame.append is deprecated since version 1.4.0 . Rather use concat() .
#dfDesdeDict3 = dfDesdeDict1.append(dfDesdeDict2, ignore_index=True)
# con _append si funciona
dfDesdeDict3 = dfDesdeDict1._append(dfDesdeDict2, ignore_index=True)
dfDesdeDict3

   Id     Nombre  Apellido Resultado  Nota
0   1       Juan    Garcia  Suspenso   4.5
1   2      Pedro   Sanchez  Aprobado   8.9
2   3  Estefania     Lopez  Suspenso   1.4
3   4        Ana    Garcia  Aprobado   5.6
4   5    Esteban  Gonzalez  Aprobado   7.8
5   6     Silvia  Gonzalez       NaN   5.5
6   7      Pedro     Perez       NaN   8.9

In [76]:
# Agregar los datos del df_nuevo al dfDesdeDict3
data3 = [[8,'Jorge','Garcia','Suspenso', 4.5], [9,'Maria','Gonzalez','Aprobado',8.9]]
#df_nuevo = pd.DataFrame(data3, columns=['Id','Nombre','Apellido','Resultado','Nota'])
df_nuevo = pd.DataFrame(data3, columns=dfDesdeDict3.columns)
dfDesdeDict3= pd.concat([dfDesdeDict3,df_nuevo], ignore_index=True)
dfDesdeDict3

   Id     Nombre  Apellido Resultado  Nota
0   1       Juan    Garcia  Suspenso   4.5
1   2      Pedro   Sanchez  Aprobado   8.9
2   3  Estefania     Lopez  Suspenso   1.4
3   4        Ana    Garcia  Aprobado   5.6
4   5    Esteban  Gonzalez  Aprobado   7.8
5   6     Silvia  Gonzalez       NaN   5.5
6   7      Pedro     Perez       NaN   8.9
7   8      Jorge    Garcia  Suspenso   4.5
8   9      Maria  Gonzalez  Aprobado   8.9

In [77]:
# Mostrar cuantos aprobados o suspensos tenemos
#dfDesdeDict3.groupby('Resultado')['Id'].count()
# es lo mismo
print(dfDesdeDict3.groupby(["Resultado"]).size())

Resultado
Aprobado    4
Suspenso    3
dtype: int64

In [69]:
data = {
  'co2': [95, 90, 99, 104, 105, 94, 99, 104],
  'model': ['Citigo', 'Fabia', 'Fiesta', 'Rapid', 'Focus', 'Mondeo', 'Octavia', 'B-Max'],
  'car': ['Skoda', 'Skoda', 'Ford', 'Skoda', 'Ford', 'Ford', 'Skoda', 'Ford']
}

df = pd.DataFrame(data)

print("Media:",df["co2"].mean(), "Max:",df["co2"].max() )

Media: 98.75 Max: 105

In [46]:
# Agrupar por apellido y resultado
dfDesdeDict3.groupby(['Apellido','Resultado'])['Id'].count()

Apellido  Resultado
Garcia    Aprobado     1
          Suspenso     1
Gonzalez  Aprobado     1
Lopez     Suspenso     1
Sanchez   Aprobado     1
Name: Id, dtype: int64

# Tipos de merge:
# inner:  solo en comun
# left: todos los de la izquierda + en comun
# right: todos los de la derecha + en comun
# outer: todos

In [86]:
# Preparar los 2 dataframes con un campo en comun
dict1 = [{'Id':1, 'Nombre':'Pantalla', 'Precio':129.50},
         {'Id':2, 'Nombre':'Teclado', 'Precio':49.95},
         {'Id':3, 'Nombre':'Raton', 'Precio':19.75},
         {'Id':4, 'Nombre':'Scanner', 'Precio':300}]
df1 = pd.DataFrame(dict1)

dict2 = [{'Nombre':'Pantalla', 'Proveedor':'Lenovo'},
         {'Nombre':'Teclado', 'Proveedor':'Logitech'},
         {'Nombre':'Raton', 'Proveedor':'Microsoft'},
         {'Nombre':'Impresora', 'Proveedor':'HP'}]
df2 = pd.DataFrame(dict2)
print(df1)
print(df2)

   Id    Nombre  Precio
0   1  Pantalla  129.50
1   2   Teclado   49.95
2   3     Raton   19.75
3   4   Scanner  300.00
      Nombre  Proveedor
0   Pantalla     Lenovo
1    Teclado   Logitech
2      Raton  Microsoft
3  Impresora         HP

In [ ]:
# merge: inner
df_inner = pd.merge(df1, df2, how='inner', on=['Nombre'])
df_inner

In [37]:
# !pip install pandas

In [ ]:
# actualiza todo a la ultima version
# pip freeze --local | grep -v '^\-e' | cut -d = -f 1  | xargs -n1 pip install -U
# !pip freeze --local | grep -v '^\-e' | cut -d = -f 1  | xargs -n1 pip install -U

In [38]:
!jupyter --version

Selected Jupyter core packages...
IPython          : not installed
ipykernel        : not installed
ipywidgets       : not installed
jupyter_client   : 7.3.5
jupyter_core     : 4.11.1
jupyter_server   : not installed
jupyterlab       : not installed
nbclient         : 0.7.0
nbconvert        : 7.2.1
nbformat         : 5.7.0
notebook         : not installed
qtconsole        : not installed
traitlets        : 5.4.0

In [39]:
# pip install --upgrade pandas

In [40]:
# pip list